WELCOME = '''
🎉 سلام! 
 خوش اومدید به دستیار هوشمند کاتب 🎉

این‌جا جایی هست که خلاقیت شما با هوش مصنوعی شکوفا میشه. 🌟 اگر به دنبال تولید محتوای متنی با کیفیت بالا و محتوای منحصر به فرد هستید، درست اومدید! 🏆

فقط کافیه موضوع مورد نظرتون رو بفرستید و اجازه بدید ما به شما کمک کنیم. 📚✍️

✨ با ما همراه باشید و از قدرت هوش مصنوعی بهره‌مند بشید. 🚀

📝 بیایید با هم شروع کنیم و محتوای فوق‌العاده بنویسیم! 💡📄
'''

GUIDE_TEXT = '''
راهنمای استفاده از دستیارِ هوشمند کاتب 📚✨

سلام! به دستیارِ هوشمند کاتب خوش آمدید. 🤖🌟
این دستیار با استفاده از هوش مصنوعی، به شما کمک می‌کند تا محتواهای متنی متنوع را به سادگی و سرعت ایجاد کنید. 📝🚀

برای استفاده از دستیارِ هوشمند کاتب، لطفاً مراحل زیر را دنبال کنید:

۱. شروع: 
کافیست در قسمت منوی پایین همین صفحه "تولید محتوا" را انتخاب کنید تا فرآیند آغاز شود. 🖱️🔽

۲. انتخاب موضوع:
دسته مورد نظر خود را که می‌خواهید محتوای متنی درباره آن تولید شود، انتخاب کنید.  🌐📚

۳.تعداد کلمات:
 انتخاب نمایید که محتوای مورد نظر شما شامل چند کلمه باشد.

۴. انتخاب لحن:
لحن مورد نظر خود را که مایل هستید محتوای شما با آن لحن تولید شود، انتخاب کنید. 

۵. دریافت محتوا:
پس از مشخص کردن موضوع، دستیار هوشمند کاتب، محتوای متناسب با درخواست شما را تولید خواهد کرد. این کار ممکن است چند ثانیه طول بکشد. ⏳✨

از دستیار هوشمندِ ما استفاده کنید و لذت ببرید! 😃🎉 در صورت داشتن سوال یا نیاز به کمک، به ما پیام دهید. 💬🤝
'''

CONTENT_CREATION = 'تولید محتوا'
TEXT_TO_IMAGE = 'ساخت عکس'
TEXT_TO_AUDIO = 'متن به صدا'
AUDIO_TO_TEXT = 'صدا به متن'
PROFILE = 'پروفایل'
ADD_CREDIT = 'افزایش اعتبار'
PRICING = "تعرفه ها"
GUIDE = 'راهنما'

# BACK = "بازگشت 🔙"
BACK = "بازگشت ⏪️"

CLOSE_PANEL = "❌ بستن پنل"

LACK_OF_CREDIT = "موجودی شما برای تولید این محتوا کافی نیست.\nشما میتوانید اعتبار کیف پول خود را از بخش افزایش اعتبار، افزایش دهید."

ENTER_SUBJECT = '''
*موضوع درخواستی خود برای ساخت محتوای مورد نظر رو وارد کنید.*
درخواست شما میتونه شامل کاراکتر های حروف فارسی و علائم نگارشی استاندارد باشه.
● از کاراکتر هایی مانند:
@، #، & و غیره...
یا ایموجی
نمیتونید استفاده کنید.
● در این بخش درخواست شما نمیتونه شامل ساختن عکس باشه.
● در خواست شما نمیتونه شامل ساختن جدول باشه.
'''

NOT_ALLOWED_REQUEST = '''
*متاسفانه درخواست شما شامل کاراکترهای غیرمجاز است.* ⚠️⚠️
درخواست شما میتونه شامل کاراکتر های حروف فارسی و علائم نگارشی استاندارد باشه.
● از کاراکتر هایی مانند:
@، #، & و غیره...
یا ایموجی
نمیتونید استفاده کنید.
● در این بخش درخواست شما نمیتونه شامل ساختن عکس باشه.
● در خواست شما نمیتونه شامل ساختن جدول باشه.
*لطفا مراحل را از اول دوباره تکرار کنید.*
'''

END_OF_CREATE_ARTICLE = '''
*درخواست شما با موفقیت انجام شد* 🚀🚀
برای ادامه لطفا یکی از گزینه های زیر را انتخاب کنید 👇👇
'''

RATE_LIMIT_ERROR = '''
متاسفانه سرور دارای محدودیت شده است.
لطفا بعدا دوباره برای ساخت مقاله و تولید محتوا اقدام کنید.
از صبر و شکیبایی شما ممنونیم.
🙏🙏
'''

CONTENT_CREATION_INFO = '''
مشخصات درخواست شما:
دسته بندی: category
تعداد کلمات: words_length
لحن: tone
'''

START_AGAIN = '''
لطفا مجددا تلاش کنید.
'''

RESTART = "یکی از گزینه های زیر را انتخاب کنید"

BUTTONS = [
    CONTENT_CREATION,
    ADD_CREDIT,
    PROFILE,
    GUIDE,
    BACK,
]
